using System;
using System.Drawing;
using System.IO;
using System.Reflection;
using System.Text.Json;
using System.Threading.Tasks;

namespace ASK.BLL.Helper.Setting
{
    public class SettingOptionsJSON
    {
        //-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //                                                  Общиие настройки
        //-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //Общее
        public string NameASKSystem { get; set; } = "Автоматизированная система контроля за выбросами загрязняющих веществ в атмосферный воздух";//Название объекта в Excel
        public string NameASK { get; set; } = "Электро статический фильтр ПТДГ г. Борисов.";//Название объекта в Excel
        public string NumberASK { get; set; } = "10484";//Название объекта в Excel
        public string NoneValue { get; set; } = "-/-"; //Нет значения
        public string AuthorName { get; set; } = "SIMATEK (Evgen)";



        


        //-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //                                                  Отчёт за сутки
        //-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //Данные
        public string ReportDay_Name { get; set; } = "Отчёт за сутки"; //Имя отчёта за сутки (20м) + дописывается дата отчёта(в самом excel)
        public string ReportDay_NameTable { get; set; } = "Концентрации, выбросы, параметры усреднённые за 20 мин"; //Наз. таблицы в сутчном отчёте
        //Визуалка
        public string ReportDay_FontName { get; set; } = "Times New Roman"; //шрифт в отчёте
        public int ReportDay_FontSize { get; set; } = 10; //Размер шрифта в отчёте (весь отчёт)
        public bool ReportDay_FontBoldHeader { get; set; } = true; //Использовать жирный шрифт в заголовках и подвалах 
        public bool ReportDay_FontBoldTable { get; set; } = false; //Использовать жирный теле таблицы/значения 20м



        //-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //                                                  Отчёт за месяц
        //-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //Данные
        public string ReportMonth_Name { get; set; } = "Отчёт за месяц"; //Имя отчёта за сутки (20м) + дописывается дата отчёта(в самом excel)
        public string ReportMonth_NameTable { get; set; } = "Концентрации, выбросы, параметры усреднённые за сутки"; //Наз. таблицы в сутчном отчёте
        //Визуалка
        public string ReportMonth_FontName { get; set; } = "Times New Roman"; //шрифт в отчёте
        public int ReportMonth_FontSize { get; set; } = 10; //Размер шрифта в отчёте (весь отчёт)
        public bool ReportMonth_FontBoldHeader { get; set; } = true; //Использовать жирный шрифт в заголовках и подвалах 
        public bool ReportMonth_FontBoldTable { get; set; } = false; //Использовать жирный теле таблицы/значения 20м


    }
}
